app/controllers/notes_controller.rb

  def create
    @note = Note.new(params[:note])

    respond_to do |format|
      if @note.save
---
INSERT INTO "notes" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "etrt"], ["created_at", Mon, 03 Jun 2013 19:49:16 UTC +00:00], ["updated_at", Mon, 03 Jun 2013 19:49:16 UTC +00:00]]

  def update
    @note = Note.find(params[:id])

    respond_to do |format|
      if @note.update_attributes(params[:note])
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "notes" SET "content" = 'Pairing accelerates cars.', "updated_at" = '2013-06-03 19:31:02.652433' WHERE "notes"."id" = 4